iarsystems/ewarm-toshiba-example-projects/TMPM4GR/Libraries/startup/startup_TMPM4GR.s
                PUBWEAK INTI2C0ATX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C0ATX_IRQHandler
                B       INTI2C0ATX_IRQHandler

                PUBWEAK INTI2C0BRX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C0BRX_IRQHandler
                B       INTI2C0BRX_IRQHandler

                PUBWEAK INTI2C0NA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C0NA_IRQHandler
                B       INTI2C0NA_IRQHandler

                PUBWEAK INTI2C1NST_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C1NST_IRQHandler
                B       INTI2C1NST_IRQHandler

                PUBWEAK INTI2C1ATX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C1ATX_IRQHandler
                B       INTI2C1ATX_IRQHandler

                PUBWEAK INTI2C1BRX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C1BRX_IRQHandler
                B       INTI2C1BRX_IRQHandler

                PUBWEAK INTI2C1NA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C1NA_IRQHandler
                B       INTI2C1NA_IRQHandler

                PUBWEAK INTI2C2NST_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2NST_IRQHandler
                B       INTI2C2NST_IRQHandler

                PUBWEAK INTI2C2ATX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2ATX_IRQHandler
                B       INTI2C2ATX_IRQHandler

                PUBWEAK INTI2C2BRX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2BRX_IRQHandler
                B       INTI2C2BRX_IRQHandler

                PUBWEAK INTI2C2NA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2NA_IRQHandler
                B       INTI2C2NA_IRQHandler

                PUBWEAK INTI2C3NST_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3NST_IRQHandler
                B       INTI2C3NST_IRQHandler

                PUBWEAK INTI2C3ATX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3ATX_IRQHandler
                B       INTI2C3ATX_IRQHandler

                PUBWEAK INTI2C3BRX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3BRX_IRQHandler
                B       INTI2C3BRX_IRQHandler

                PUBWEAK INTI2C3NA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3NA_IRQHandler
                B       INTI2C3NA_IRQHandler

                PUBWEAK INTI2C4NST_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4NST_IRQHandler
                B       INTI2C4NST_IRQHandler

                PUBWEAK INTI2C4ATX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4ATX_IRQHandler
                B       INTI2C4ATX_IRQHandler

                PUBWEAK INTI2C4BRX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4BRX_IRQHandler
                B       INTI2C4BRX_IRQHandler

                PUBWEAK INTI2C4NA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4NA_IRQHandler
                B       INTI2C4NA_IRQHandler

                PUBWEAK INTADACP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACP0_IRQHandler
                B       INTADACP0_IRQHandler

                PUBWEAK INTADACP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACP1_IRQHandler
                B       INTADACP1_IRQHandler

                PUBWEAK INTADATRG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADATRG_IRQHandler
                B       INTADATRG_IRQHandler

                PUBWEAK INTADASGL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADASGL_IRQHandler
                B       INTADASGL_IRQHandler

                PUBWEAK INTADACNT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACNT_IRQHandler
                B       INTADACNT_IRQHandler

                PUBWEAK INTADAHP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAHP_IRQHandler
                B       INTADAHP_IRQHandler

                PUBWEAK INTFLDRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLDRDY_IRQHandler
                B       INTFLDRDY_IRQHandler

                PUBWEAK INTFLCRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLCRDY_IRQHandler
                B       INTFLCRDY_IRQHandler

                PUBWEAK INTMDMAABERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAABERR_IRQHandler
                B       INTMDMAABERR_IRQHandler

                PUBWEAK INTMDMAADERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAADERR_IRQHandler
                B       INTMDMAADERR_IRQHandler

                PUBWEAK INTI2S0SI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S0SI_IRQHandler
                B       INTI2S0SI_IRQHandler

                PUBWEAK INTI2S0SIERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S0SIERR_IRQHandler
                B       INTI2S0SIERR_IRQHandler

                PUBWEAK INTI2S0SO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S0SO_IRQHandler
                B       INTI2S0SO_IRQHandler

                PUBWEAK INTI2S0SOERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S0SOERR_IRQHandler
                B       INTI2S0SOERR_IRQHandler

                PUBWEAK INTI2S1SI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SI_IRQHandler
                B       INTI2S1SI_IRQHandler

                PUBWEAK INTI2S1SIERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SIERR_IRQHandler
                B       INTI2S1SIERR_IRQHandler

                PUBWEAK INTI2S1SO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SO_IRQHandler
                B       INTI2S1SO_IRQHandler

                PUBWEAK INTI2S1SOERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SOERR_IRQHandler
                B       INTI2S1SOERR_IRQHandler

                PUBWEAK INTFIR0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFIR0_IRQHandler
                B       INTFIR0_IRQHandler

                PUBWEAK INTTSSI0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0RX_IRQHandler
                B       INTTSSI0RX_IRQHandler

